Revit 2027 API
StairsLanding.GetStairsPath Method
 Returns the stairs path curves on the landing. The curves are projected on the stairs base level.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public CurveLoop GetStairsPath()
Public Function GetStairsPath As CurveLoop
public:
CurveLoop^ GetStairsPath()
member GetStairsPath : unit -> CurveLoop
Return Value
CurveLoop
 The stairs path curves of the landing.
See Also
Reference
StairsLanding Class
Autodesk.Revit.DB.Architecture Namespace